---
kind: property
id: P:Autodesk.Revit.UI.Events.ViewActivatedEventArgs.CurrentActiveView
source: html/5e105bf3-a62b-9998-f1b7-32c393f138b1.htm
---
# Autodesk.Revit.UI.Events.ViewActivatedEventArgs.CurrentActiveView Property

The view that has just become active.

## Syntax (C#)
```csharp
public View CurrentActiveView { get; }
```